// 某企业发放的奖金是根据利润计提的。利润I低于或等于100000元时，奖金可提成10%；利润高于100000元低于200000（即100000<利润<=200000）时，低于100000元的部分按10%提成，高于100000的部分，按7.5%提成；200000<利润<=400000时，低于200000的部分仍按上述办法提成，高于200000的部分按5%提成；400000<利润<=600000时，高于400000的部分按3%提成；600000<利润<=1000000时，高于600000的部分按1.5%提成；利润高于1000000时，超过1000000元的部分按1%提成。从键盘输入当月利润I，求应发奖金总数。
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int I;
    int* profit = (int[]) { 1000000, 600000, 400000, 200000, 100000, 0, -1 };
    double* percentage = (double[]) { 0.01, 0.015, 0.03, 0.05, 0.075, 0.1, 0 };
    double bonus = 0;
    scanf("%d", &I);

    while (*profit != -1) {
        if (I > *profit) {
            bonus = bonus + *percentage * (I - *profit);
            I = *profit;
        }
        percentage++;
        profit++;
    }

    printf("%.2f", bonus);
    return 0;
}